app/controllers/artists_controller.rb

  def create
    @artist = Artist.new(artist_params)

    if @artist.save
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Modest Mouse"], ["created_at", "2020-02-02 17:11:35.251797"], ["updated_at", "2020-02-02 17:11:35.251797"]]