app/controllers/songs_controller.rb

  def update
    @song = Song.find(params[:id])
    @song.build_artist(name: params[:artist][:name])
    @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 3], ["updated_at", "2020-02-02 17:11:01.678045"], ["id", 3]]